Revit 2024 API
CurtainGrid.GetUnlockedPanelIds Method
 Gets all ElementIds of the unlocked panels of the curtain grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ICollection<ElementId> GetUnlockedPanelIds()
Visual Basic
Public Function GetUnlockedPanelIds As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetUnlockedPanelIds()
Return Value
The unlocked panel ElementIds
Remarks
 For curtain walls, the ElementIds in this set are of either Panel or Wall Elements. For curtain systems, ElementIds are of Panel Elements.
See Also
CurtainGrid Class
Autodesk.Revit.DB Namespace